RegiXResources/RegiXAdapters/TRAdapter/TR_ActualStateRequestV3.xml

<s:Envelope xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:s="http://www.w3.org/2003/05/soap-envelope">
  <s:Header>
    <a:Action s:mustUnderstand="1">http://tempuri.org/IRegiXEntryPoint/ExecuteSynchronous</a:Action>
    <a:MessageID>urn:uuid:889dd405-fca5-4d91-b8cc-75e394600d57</a:MessageID>
    <ActivityId CorrelationId="b0a93a9d-ff99-46a4-b781-d03a587f058a" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">ba089f1a-ac98-4356-a317-4e2fa4db6843</ActivityId>
    <a:ReplyTo>
      <a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
    </a:ReplyTo>
  </s:Header>
  <s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
    <ExecuteSynchronous xmlns="http://tempuri.org/">
      <request>
        <Operation>TechnoLogica.RegiX.AVTRAdapter.APIService.ITRAPI.GetActualStateV3</Operation>
        <Argument>
          <ActualStateRequestV3 xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="http://egov.bg/RegiX/AV/TR/ActualStateRequestV3">
            <UIC>1645824597854</UIC>
            <FieldList>001,002,00020</FieldList>
          </ActualStateRequestV3>
        </Argument>
        <CallContext>
          <ServiceURI>1234</ServiceURI>
          <ServiceType>За административна услуга</ServiceType>
          <EmployeeIdentifier>defaultuser</EmployeeIdentifier>
          <EmployeeNames>Администратор</EmployeeNames>
          <EmployeeAditionalIdentifier />
          <EmployeePosition>Администратор</EmployeePosition>
          <AdministrationOId>2.16.100.1.1.8.1.2</AdministrationOId>
          <AdministrationName>Агенция "Митници"</AdministrationName>
          <LawReason>За целите на разработката и тестването на RegiX.</LawReason>
          <Remark />
        </CallContext>
        <SignResult>true</SignResult>
        <ReturnAccessMatrix>false</ReturnAccessMatrix>
      </request>
    </ExecuteSynchronous>
  </s:Body>
</s:Envelope>